<template>
  <section id="detali">
    <div class="container">
      <div class="title-box">
        <h2>Каждая деталь <span> работает&nbsp;на&nbsp;вас </span></h2>
        <p class="subtitle">Аппарат «Дионис» не содержит ничего лишнего</p>
      </div>
      <div class="detali-wrapper">
        <div v-if="!mobile" class="detali-wrapper__col col-1">
          <div
            v-for="(item, index) in detalies.filter((el) => el.col == 1)"
            :key="index"
            :class="'detali-item' + ' detali-item-' + (index + 1)"
          >
            <h3 v-html="item.title"></h3>
            <p v-html="item.text"></p>
            <div
              v-if="item.modal"
              class="button-modal"
              @click="openDetaliModal(item)"
            >
              Подробнее
            </div>
          </div>
        </div>
        <div class="detali-wrapper__img">
          <picture>
            <source
              data-srcset="/build/images/detali/detali.webp"
              media="(min-width: 1366px)"
              type="image/webp"
              srcset="/build/images/detali/detali.webp" />
            <source
              data-srcset="/build/images/detali/detali.png"
              media="(min-width: 1366px)"
              srcset="/build/images/detali/detali.png" />

            <source
              data-srcset="/build/images/detali/detali@05x.webp"
              type="image/webp"
              srcset="/build/images/detali/detali@05x.webp" />
            <img
              class="lazy"
              data-src="/build/images/detali/detali@05x.png"
              alt=""
              src="/build/images/detali/detali@05x.png"
          /></picture>

          <template v-if="mobile">
            <div
              v-for="(item, index) in detalies"
              :key="index"
              v-html="item.svg"
              :class="'will-change--active svg-item svg-item-' + (index + 1)"
              @click="
                showHide(index);
                scrollToSection('svg-item-' + (index + 1) + '-ref');
              "
            ></div>
          </template>
        </div>
        <div v-if="!mobile" class="detali-wrapper__col col-2">
          <div
            v-for="(item, index) in detalies.filter((el) => el.col == 2)"
            :key="index"
            :class="'detali-item' + ' detali-item-' + (index + 1)"
          >
            <h3 v-html="item.title"></h3>
            <p v-html="item.text"></p>
            <div
              v-if="item.modal"
              class="button-modal"
              @click="openDetaliModal(item)"
            >
              Подробнее
            </div>
          </div>
        </div>
        <div v-if="mobile" class="detali-wrapper__collapse">
          <div
            v-for="(item, index) in detalies"
            :key="index"
            :class="'collapse-item svg-item-' + (index + 1) + '-ref'"
          >
            <div @click="showHide(index)" class="collapse-item__title">
              <p v-html="item.title"></p>
              <button>
                <svg
                  :style="
                    item.open
                      ? 'transform: rotate(180deg)'
                      : 'transform: rotate(0deg)'
                  "
                  xmlns="http://www.w3.org/2000/svg"
                  width="16"
                  height="9"
                  viewBox="0 0 16 9"
                  fill="none"
                >
                  <path
                    d="M7.29289 8.70711C7.68342 9.09763 8.31658 9.09763 8.70711 8.70711L15.0711 2.34315C15.4616 1.95262 15.4616 1.31946 15.0711 0.928932C14.6805 0.538408 14.0474 0.538408 13.6569 0.928932L8 6.58579L2.34315 0.928932C1.95262 0.538408 1.31946 0.538408 0.928932 0.928932C0.538408 1.31946 0.538408 1.95262 0.928932 2.34315L7.29289 8.70711ZM7 7V8H9V7H7Z"
                    fill="#323232"
                  />
                </svg>
              </button>
            </div>
            <transition
              name="collapse"
              v-on:before-enter="beforeEnter"
              v-on:enter="enter"
              v-on:before-leave="beforeLeave"
              v-on:leave="leave"
            >
              <div v-show="item.open" class="collapse-item__content">
                <div class="text-box">
                  <p v-html="item.text"></p>
                </div>
              </div>
            </transition>
          </div>
        </div>
      </div>
    </div>

    <div id="detali-modal" style="display: none">
      <div class="detali-modal">
        <my-image
          class="detali-modal__img"
          :alt="'#'"
          :imgName="modal.img"
          :floder="'detali'"
          :lazyLoad="false"
          :mobile="false"
        />
        <div class="detali-modal__content">
          <div class="detali-modal__title" v-html="modal.title"></div>
          <div
            v-for="(item, index) in modal.decr"
            :key="index"
            class="detali-modal__decr"
            v-html="item"
          ></div>

          <div>
            <div
              v-for="(item, index) in modal.list"
              :key="index"
              class="detali-modal__decr"
              v-html="item"
            ></div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
import MyImage from "../UI/MyImage.vue";
import transitionHeight from "../mixins/transitionHeight";

export default {
  mixins: [transitionHeight],
  components: { MyImage },
  data() {
    return {
      mobile: window.innerWidth < 1367,
      detalies: [
        {
          title: "Высокоточные термометры",
          text: `2 электронных высокоточных термометра позволяют следить за нагревом браги и паров самогона, идущих в холодильник. Это даёт самые полные и точные показания.`,
          col: 1,
          modal: {
            decr: [
              `2 электронных высокоточных термометра позволяют следить за нагревом браги и паров самогона, идущих в 
              холодильник. Это даёт самые полные и точные показания.`,
            ],
            img: "detali-modal-1",
            list: [
              "<span> Диапазон измерения</span> — от -50 до +300°С",
              "<span>Размер</span> — 40х30х30 мм",
              "<span>Длина щупа</span> — 50 мм",
              "<span>Дисплей</span> — цифровой",
            ],
          },
          open: false,
          svg: `<svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
                  <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
                  <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
                  <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
                </svg>`,
        },

        {
          title: "Штуцеры",
          text: `Штуцеры для подключения воды сделаны таким образом, чтобы в процессе работы шланг не «слезал» и не загибался.`,
          modal: {
            decr: [
              `Штуцеры для подключения воды сделаны таким образом, чтобы в процессе работы шланг не «слезал» и не загибался.`,
            ],
            img: "detali-modal-2",
            list: [
              "<span>Диаметр</span> — 8 мм",
              "<span>Материал</span> — медицинская нержавеющая сталь AISI 304",
            ],
          },
          col: 1,
          open: false,
          svg: `<svg xmlns="http://www.w3.org/2000/svg" width="69" height="25" viewBox="0 0 69 25" fill="none">
                  <circle cx="56.5" cy="12.5" r="12.5" fill="#5D68A3"/>
                  <path d="M55.4553 14.7388V14.5527C55.459 13.9141 55.5155 13.4051 55.625 13.0256C55.7381 12.6461 55.9023 12.3396 56.1176 12.106C56.3329 11.8725 56.592 11.6609 56.8949 11.4711C57.1211 11.3251 57.3236 11.1737 57.5024 11.0168C57.6812 10.8599 57.8236 10.6866 57.9294 10.4968C58.0352 10.3034 58.0881 10.0881 58.0881 9.85092C58.0881 9.59914 58.0279 9.37837 57.9075 9.18862C57.7871 8.99887 57.6247 8.85291 57.4203 8.75073C57.2196 8.64856 56.997 8.59747 56.7526 8.59747C56.5154 8.59747 56.291 8.65038 56.0793 8.75621C55.8677 8.85838 55.6943 9.01164 55.5593 9.21599C55.4243 9.41669 55.3513 9.66665 55.3404 9.96587H53.1072C53.1254 9.23606 53.3006 8.63396 53.6326 8.15959C53.9647 7.68156 54.4044 7.32578 54.9518 7.09224C55.4991 6.85505 56.103 6.73646 56.7635 6.73646C57.4897 6.73646 58.1319 6.85688 58.6902 7.09771C59.2485 7.3349 59.6864 7.67974 60.0039 8.13222C60.3213 8.5847 60.4801 9.13024 60.4801 9.76882C60.4801 10.1958 60.4089 10.5753 60.2666 10.9073C60.1279 11.2357 59.9327 11.5277 59.6809 11.7831C59.4291 12.0349 59.1317 12.2629 58.7887 12.4673C58.5005 12.6388 58.2633 12.8176 58.0772 13.0037C57.8947 13.1898 57.7579 13.4051 57.6667 13.6496C57.5791 13.8941 57.5335 14.1951 57.5298 14.5527V14.7388H55.4553ZM56.5391 18.2419C56.1742 18.2419 55.8622 18.1142 55.6031 17.8588C55.3477 17.5997 55.2218 17.2895 55.2254 16.9283C55.2218 16.5707 55.3477 16.2641 55.6031 16.0087C55.8622 15.7533 56.1742 15.6256 56.5391 15.6256C56.8858 15.6256 57.1904 15.7533 57.4532 16.0087C57.7159 16.2641 57.8491 16.5707 57.8528 16.9283C57.8491 17.1691 57.7852 17.3899 57.6612 17.5906C57.5408 17.7876 57.382 17.9463 57.185 18.0668C56.9879 18.1835 56.7726 18.2419 56.5391 18.2419Z" fill="white"/>
                  <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5L44 13.5L44 12.5L3 12.5L3 13.5Z" fill="#5D68A3"/>
                </svg>`,
        },

        {
          title: "Скошенный сливной носик",
          text: `Правильная форма носика предотвращает пузырение дистиллята на выходе и делает отбор ещё проще и удобнее.`,
          col: 1,
          open: false,
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>`,
        },

        {
          title: "Ручки",
          text: `Надоело, что горячий аппарат невозможно снять с плиты? Мы думаем о вашем комфорте! Ручки «Диониса» расположены на самом удобном для работы и транспортировки месте. С ними перемещать бак удобно и просто.`,
          col: 1,
          open: false,
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>`,
        },

        {
          title: "Кран для слива (только <br> для баков на 25 л)",
          text: `Удобный диаметр крана позволяет сливать барду без риска забивания и засорения отверстия. Благодаря изогнутому носику жидкость будет сливаться прямо в подготовленную ёмкость.`,
          modal: {
            decr: [
              "Удобный диаметр крана позволяет сливать барду без риска забивания и засорения отверстия. Благодаря изогнутому носику жидкость будет сливаться прямо в подготовленную ёмкость.",
            ],
            img: "detali-modal-3",
            list: [
              "<span>Диаметр крана</span> — ½ дюйма",
              "<span>Длина</span> — 95 мм",
              "<span>Высота</span> — 85 мм",
            ],
          },
          col: 1,
          open: false,
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },

        {
          title: "Кламп 2 дюйма",
          text: `Аппарат легко подстраивается ваши задачи: универсальное кламповое крепление на 2 дюйма позволит поставить практически любое дополнительное оборудование.`,
          col: 2,
          open: false,
          modal: {
            decr: [
              `Аппарат легко подстраивается ваши задачи: универсальное кламповое крепление на 2 дюйма позволит 
              поставить практически любое дополнительное оборудование. Неслучайно профессиональные винокуры выбирают 
              именно этот диаметр: он обеспечивает максимальную производительность аппарата, большую площадь конденсации флегмы, 
              лучшее качество и вкус готового напитка.`,
            ],
            img: "detali-modal-4",
            list: [
              "<span>Диаметр основания колонны</span> — 50 мм",
              "<span>Диаметр соединительных трубок</span> — 18 мм",
            ],
          },
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },

        {
          title: "Мощный холодильник",
          text: `Профессиональный кожухотрубный холодильник увеличивает площадь охлаждения и улучшает теплообмен.Он оснащён изогнутыми перегородками, которые поддерживают однородную температуру воды.`,
          col: 2,
          open: false,
          modal: {
            decr: [
              `Профессиональный кожухотрубный холодильник увеличивает площадь охлаждения и улучшает теплообмен.
               Он оснащён изогнутыми перегородками, которые поддерживают однородную температуру воды.`,
            ],
            img: "detali-modal-5",
            list: [
              "<span>Материал</span> — медицинская нержавеющая сталь AISI 304",
              "<span>Диаметр канала</span> — 10 мм",
              "<span>Длина трубки</span> — 260 мм",
              "<span>Количество барьеров</span> — 3",
              "<span>Количество трубок </span> — 5 штук",
              "<span>Мощность холодильника</span> — 7 кВт",
            ],
          },
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },

        {
          title: "Воздушный дефлегматор",
          text: `Внутри царги 4 чешуйчатых тарелки, через которые пар проходит волнами — от края нижней к другому краю верхней. Так он задерживается внутри, поэтому на 32% эффективнее орошается флегмой, в сравнении с обычными тарелками.`,
          col: 2,
          open: false,
          modal: {
            decr: [
              `Внутри царги 4 чешуйчатых тарелки, через которые пар проходит волнами — от края нижней к другому краю верхней.
               Так он задерживается внутри, поэтому на 32% эффективнее орошается флегмой, в сравнении с обычными тарелками.`,
              `На поверхность можно выложить фрукты, ароматные травы и очищающие насадки. Пар пройдёт через них, и уже
               с первой перегонкой вы получите вкусный и чистый домашний напиток.`,
            ],
            img: "detali-modal-6",
            list: [
              `<span>Материал</span> — медицинская нержавеющая сталь AISI 304`,
              `<span>Высота</span> — 180 мм`,
              `<span>Количество сегментов</span> — 4`,
            ],
          },
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },

        {
          title: "Трубка связи с атмосферой",
          text: `Избавляет от воздушной пробки и пульсации продукта на выходе.`,
          col: 2,
          open: false,
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },

        {
          title: "Зиговка на баке для сита",
          text: `Даёт возможность установки на бак сита для густых браг и пивоварения. `,
          col: 2,
          open: false,
          svg: `
          <svg xmlns="http://www.w3.org/2000/svg" width="53" height="25" viewBox="0 0 53 25" fill="none">
            <circle cx="40.5" cy="12.5" r="12.5" fill="#5D68A3"/>
            <path d="M39.4553 14.7388V14.5527C39.459 13.9141 39.5155 13.4051 39.625 13.0256C39.7381 12.6461 39.9023 12.3396 40.1176 12.106C40.3329 11.8725 40.592 11.6609 40.8949 11.4711C41.1211 11.3251 41.3236 11.1737 41.5024 11.0168C41.6812 10.8599 41.8236 10.6866 41.9294 10.4968C42.0352 10.3034 42.0881 10.0881 42.0881 9.85092C42.0881 9.59914 42.0279 9.37837 41.9075 9.18862C41.7871 8.99887 41.6247 8.85291 41.4203 8.75073C41.2196 8.64856 40.997 8.59747 40.7526 8.59747C40.5154 8.59747 40.291 8.65038 40.0793 8.75621C39.8677 8.85838 39.6943 9.01164 39.5593 9.21599C39.4243 9.41669 39.3513 9.66665 39.3404 9.96587H37.1072C37.1254 9.23606 37.3006 8.63396 37.6326 8.15959C37.9647 7.68156 38.4044 7.32578 38.9518 7.09224C39.4991 6.85505 40.103 6.73646 40.7635 6.73646C41.4897 6.73646 42.1319 6.85688 42.6902 7.09771C43.2485 7.3349 43.6864 7.67974 44.0039 8.13222C44.3213 8.5847 44.4801 9.13024 44.4801 9.76882C44.4801 10.1958 44.4089 10.5753 44.2666 10.9073C44.1279 11.2357 43.9327 11.5277 43.6809 11.7831C43.4291 12.0349 43.1317 12.2629 42.7887 12.4673C42.5005 12.6388 42.2633 12.8176 42.0772 13.0037C41.8947 13.1898 41.7579 13.4051 41.6667 13.6496C41.5791 13.8941 41.5335 14.1951 41.5298 14.5527V14.7388H39.4553ZM40.5391 18.2419C40.1742 18.2419 39.8622 18.1142 39.6031 17.8588C39.3477 17.5997 39.2218 17.2895 39.2254 16.9283C39.2218 16.5707 39.3477 16.2641 39.6031 16.0087C39.8622 15.7533 40.1742 15.6256 40.5391 15.6256C40.8858 15.6256 41.1904 15.7533 41.4532 16.0087C41.7159 16.2641 41.8491 16.5707 41.8528 16.9283C41.8491 17.1691 41.7852 17.3899 41.6612 17.5906C41.5408 17.7876 41.382 17.9463 41.185 18.0668C40.9879 18.1835 40.7726 18.2419 40.5391 18.2419Z" fill="white"/>
            <path d="M0.333333 13C0.333333 14.4728 1.52724 15.6667 3 15.6667C4.47276 15.6667 5.66667 14.4728 5.66667 13C5.66667 11.5272 4.47276 10.3333 3 10.3333C1.52724 10.3333 0.333333 11.5272 0.333333 13ZM3 13.5H28V12.5H3V13.5Z" fill="#5D68A3"/>
          </svg>
          `,
        },
      ],
      modal: {
        title: ``,
        decr: [],
        list: [],
        img: "detali-modal-1",
      },
    };
  },

  methods: {
    scrollToSection(selector) {
      if (window.innerWidth < 768) {
        setTimeout(() => {
          this.gsap.to(window, {
            duration: 1.5,
            scrollTo: {
              y:
                document.querySelector("." + selector).offsetTop -
                document.querySelector("." + selector).offsetHeight,
            },
          });
        }, 500);
      }
    },

    showHide(i) {
      this.detalies.forEach((element, index) => {
        index == i
          ? (element.open = element.open == true ? false : true)
          : (element.open = false);
      });
    },

    openDetaliModal(el) {
      this.modal.title = el.title;
      this.modal.decr = el.modal.decr;
      this.modal.list = el.modal.list;
      this.modal.img = el.modal.img;

      setTimeout(() => {
        Fancybox.show([
          {
            src: "#detali-modal",
          },
        ]);
      }, 10);
    },
  },

  mounted() {
    const windowbreakpoint = window.matchMedia("(max-width: 1366px)");
    const breakpointChecker = () => {
      if (!windowbreakpoint.matches) {
        this.mobile = false;
      } else {
        this.mobile = true;
      }
    };

    windowbreakpoint.addListener(breakpointChecker);
    breakpointChecker();
  },
};
</script>

<style lang="scss">
@import "../../scss/_global.scss";

#detali {
  @extend %padd;

  .container {
    width: 98%;

    @media (max-width: 1366px) {
      width: 90%;
    }
  }

  .detali-wrapper {
    display: flex;
    width: 100%;
    gap: 20px;
    justify-content: center;

    @media (max-width: 767px) {
      flex-direction: column;
      align-items: center;
      gap: 50px;
    }

    &__img {
      position: relative;

      @include aspect() {
        aspect-ratio: 557/1484;
        width: 557px;

        @media (max-width: 1366px) {
          aspect-ratio: 280/748;
          width: 280px;
        }

        @media (max-width: 576px) {
          width: 240px;
        }
      }

      img {
        @media (max-width: 1366px) {
          max-width: 280px;
          width: 100%;

          @media (max-width: 576px) {
            max-width: 240px;
          }
        }
      }

      .svg-item {
        position: absolute;

        @media (min-width: 577px) {
          transform: scale(1.4);
        }

        svg {
          cursor: pointer;

          path {
            transition: all 0.4s;
          }
        }

        &:hover {
          svg {
            path {
              filter: drop-shadow(2px 4px 5px #fff);
            }
          }
        }

        &-1 {
          top: 0;
          left: 117px;

          @media (max-width: 576px) {
            top: -3px;
            left: 91px;
          }
        }

        &-2 {
          top: 115px;
          left: 19px;

          @media (max-width: 576px) {
            top: 96px;
            left: 5px;
          }
        }

        &-3 {
          top: 330px;
          left: 36px;

          @media (max-width: 576px) {
            top: 284px;
            left: 22px;
          }
        }

        &-4 {
          top: 407px;
          left: 45px;

          @media (max-width: 576px) {
            top: 351px;
            left: 37px;
          }
        }

        &-5 {
          top: 680px;
          left: 40px;

          @media (max-width: 576px) {
            top: 580px;
          }
        }

        &-6 {
          top: 194px;
          left: 174px;

          @media (max-width: 576px) {
            top: 164px;
            left: 139px;
          }
        }

        &-7 {
          top: 177px;
          left: 35px;

          @media (max-width: 576px) {
            left: 23px;
          }
        }

        &-8 {
          top: 260px;
          left: 160px;

          @media (max-width: 576px) {
            top: 222px;
            left: 135px;
          }
        }

        &-9 {
          top: 292px;
          left: 70px;

          @media (max-width: 576px) {
            top: 253px;
            left: 51px;
          }
        }

        &-10 {
          top: 558px;
          left: 220px;

          @media (max-width: 576px) {
            top: 500px;
            left: 195px;
          }
        }
      }
    }

    &__col {
      flex-grow: 1;

      .detali-item {
        position: relative;

        &::before {
          transition: filter 0.4s;
          position: absolute;
          z-index: 2;
        }

        &:hover {
          &::before {
            filter: drop-shadow(0px 0px 3px lighten(#5d68a3, 5%));
          }
        }
      }

      &.col-1 {
        min-width: 359px;
        max-width: 407px;
        h3 {
          padding-right: 10px;
        }
        .detali-item-1 {
          margin-top: 60px;
          &::before {
            top: -120px;
            right: -519px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iNzY4IiBoZWlnaHQ9IjcyOCIgdmlld0JveD0iMCAwIDc2OCA3MjgiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik01NTQuMzc5IDY4MC4zNjRDNTU3LjA0NiA2NzYuODQyIDU1Ni4zNTIgNjcxLjgyNCA1NTIuODMgNjY5LjE1N0M1NDkuMzA3IDY2Ni40OSA1NDQuMjkgNjY3LjE4MyA1NDEuNjIzIDY3MC43MDZDNTM4Ljk1NiA2NzQuMjI4IDUzOS42NDkgNjc5LjI0NiA1NDMuMTcxIDY4MS45MTNDNTQ2LjY5NCA2ODQuNTggNTUxLjcxMSA2ODMuODg3IDU1NC4zNzkgNjgwLjM2NFpNNDM5IDY3NS41MzVMNDM3LjUgNjc1LjUzNUw0MzcuNSA2NzcuMDM1TDQzOSA2NzcuMDM1TDQzOSA2NzUuNTM1Wk00MzkgMTM2TDQ0MC41IDEzNkw0NDAuNSAxMzQuNUw0MzkgMTM0LjVMNDM5IDEzNlpNNTQ4LjAwMSA2NzQuMDM1TDQzOSA2NzQuMDM1TDQzOSA2NzcuMDM1TDU0OC4wMDEgNjc3LjAzNUw1NDguMDAxIDY3NC4wMzVaTTQ0MC41IDY3NS41MzVMNDQwLjUgMTM2TDQzNy41IDEzNkw0MzcuNSA2NzUuNTM1TDQ0MC41IDY3NS41MzVaTTQzOSAxMzQuNUwxNTcgMTM0LjVMMTU3IDEzNy40OTlMNDM5IDEzNy41TDQzOSAxMzQuNVoiIGZpbGw9IiM1RDY4QTMiLz4KPHBhdGggZD0iTTQzOSA3MC41MzU0QzQzNC41ODIgNzAuNTM1NCA0MzEgNzQuMTE3MSA0MzEgNzguNTM1NEM0MzEgODIuOTUzNyA0MzQuNTgyIDg2LjUzNTQgNDM5IDg2LjUzNTRDNDQzLjQxOCA4Ni41MzU0IDQ0NyA4Mi45NTM3IDQ0NyA3OC41MzU0QzQ0NyA3NC4xMTcxIDQ0My40MTggNzAuNTM1NCA0MzkgNzAuNTM1NFpNNDM3LjUgNzguNTM1NEw0MzcuNSAxMzQuNUw0NDAuNSAxMzQuNUw0NDAuNSA3OC41MzU0SDQzNy41WiIgZmlsbD0iIzVENjhBMyIvPgo8L3N2Zz4K);
          }
        }

        .detali-item-2 {
          margin-top: 30px;
          &::before {
            top: -135px;
            right: -112px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iNDA3IiBoZWlnaHQ9IjQxNCIgdmlld0JveD0iMCAwIDQwNyA0MTQiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0zMjIuMjcyIDM3My4zMDhDMzI1LjMzMiAzNzAuMTIgMzI1LjIyOCAzNjUuMDU2IDMyMi4wNCAzNjEuOTk3QzMxOC44NTMgMzU4LjkzNyAzMTMuNzg4IDM1OS4wNDEgMzEwLjcyOSAzNjIuMjI5QzMwNy42NjkgMzY1LjQxNiAzMDcuNzczIDM3MC40OCAzMTAuOTYxIDM3My41NEMzMTQuMTQ5IDM3Ni41OTkgMzE5LjIxMyAzNzYuNDk1IDMyMi4yNzIgMzczLjMwOFpNMjc5LjAwMSAzNjcuNzY4TDI3Ny41MDEgMzY3Ljc2OEwyNzcuNTAxIDM2OS4yNjhMMjc5LjAwMSAzNjkuMjY4TDI3OS4wMDEgMzY3Ljc2OFpNMjc5LjAwMSAxNTIuNUwyODAuNTAxIDE1Mi41TDI4MC41MDEgMTUxTDI3OS4wMDEgMTUxTDI3OS4wMDEgMTUyLjVaTTMxNi41MDEgMzY2LjI2OEwyNzkuMDAxIDM2Ni4yNjhMMjc5LjAwMSAzNjkuMjY4TDMxNi41MDEgMzY5LjI2OEwzMTYuNTAxIDM2Ni4yNjhaTTI4MC41MDEgMzY3Ljc2OEwyODAuNTAxIDE1Mi41TDI3Ny41MDEgMTUyLjVMMjc3LjUwMSAzNjcuNzY4TDI4MC41MDEgMzY3Ljc2OFpNMjc5LjAwMSAxNTFMLTIuMjY4MTVlLTA1IDE1MUwtNS42NTYwMmUtMDYgMTU0TDI3OS4wMDEgMTU0TDI3OS4wMDEgMTUxWiIgZmlsbD0iIzVENjhBMyIvPgo8cGF0aCBkPSJNMzI1LjUgOC4xODY3MkMzMjUuNSAzLjc2ODQ1IDMyMS45MTggMC4xODY3MjIgMzE3LjUgMC4xODY3MjJDMzEzLjA4MiAwLjE4NjcyMSAzMDkuNSAzLjc2ODQ1IDMwOS41IDguMTg2NzJDMzA5LjUgMTIuNjA1IDMxMy4wODIgMTYuMTg2NyAzMTcuNSAxNi4xODY3QzMyMS45MTggMTYuMTg2NyAzMjUuNSAxMi42MDUgMzI1LjUgOC4xODY3MlpNMjc5IDguMTg2NzJMMjc5IDYuNjg2NzJMMjc3LjUgNi42ODY3MkwyNzcuNSA4LjE4NjcyTDI3OSA4LjE4NjcyWk0zMTcuNSA2LjY4NjcyTDI3OSA2LjY4NjcyTDI3OSA5LjY4NjcyTDMxNy41IDkuNjg2NzJMMzE3LjUgNi42ODY3MlpNMjc3LjUgOC4xODY3MkwyNzcuNSAxNTFMMjgwLjUgMTUxTDI4MC41IDguMTg2NzJMMjc3LjUgOC4xODY3MloiIGZpbGw9IiM1RDY4QTMiLz4KPC9zdmc+Cg==);
          }
        }

        .detali-item-3 {
          margin-top: 30px;
          &::before {
            top: 10px;
            right: -84px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMTYyIiBoZWlnaHQ9IjY0IiB2aWV3Qm94PSIwIDAgMTYyIDY0IiBmaWxsPSJub25lIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPgo8cGF0aCBkPSJNMTYxLjQ4MiA1Ni4wMzE4QzE2MS43NzYgNTEuNjIzMyAxNTguNDQxIDQ3LjgxMTIgMTU0LjAzMiA0Ny41MTczQzE0OS42MjQgNDcuMjIzNCAxNDUuODEyIDUwLjU1OSAxNDUuNTE4IDU0Ljk2NzRDMTQ1LjIyNCA1OS4zNzU5IDE0OC41NTkgNjMuMTg4IDE1Mi45NjggNjMuNDgxOUMxNTcuMzc2IDYzLjc3NTggMTYxLjE4OCA2MC40NDAyIDE2MS40ODIgNTYuMDMxOFpNMTE1LjUgNTUuNDk5NUwxMTUuNSA1Ni45OTk1TDExNS41IDU2Ljk5OTVMMTE1LjUgNTUuNDk5NVpNOTEgMS40OTk2M0w5Mi41IDEuNDk5NjNMOTIuNSAtMC4wMDAzNjMxNTFMOTEgLTAuMDAwMzY2MjkyTDkxIDEuNDk5NjNaTTkxIDU1LjQ5OTVMODkuNSA1NS40OTk1TDg5LjUgNTYuOTk5NUw5MSA1Ni45OTk1TDkxIDU1LjQ5OTVaTTE1My41IDUzLjk5OTZMMTE1LjUgNTMuOTk5NUwxMTUuNSA1Ni45OTk1TDE1My41IDU2Ljk5OTZMMTUzLjUgNTMuOTk5NlpNOTEgLTAuMDAwMzY2MjkyTDguMzc1NzllLTA2IC0wLjAwMDU1Njg0MkwyLjA5Mzk0ZS0wNiAyLjk5OTQ0TDkxIDIuOTk5NjNMOTEgLTAuMDAwMzY2MjkyWk0xMTUuNSA1My45OTk1TDkxIDUzLjk5OTVMOTEgNTYuOTk5NUwxMTUuNSA1Ni45OTk1TDExNS41IDUzLjk5OTVaTTkyLjUgNTUuNDk5NUw5Mi41IDEuNDk5NjNMODkuNSAxLjQ5OTYzTDg5LjUgNTUuNDk5NUw5Mi41IDU1LjQ5OTVaIiBmaWxsPSIjNUQ2OEEzIi8+Cjwvc3ZnPgo=);
          }
        }

        .detali-item-4 {
          margin-top: 30px;
          &::before {
            top: -57px;
            right: -543px;
            z-index: 3;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iODU5IiBoZWlnaHQ9IjE2NSIgdmlld0JveD0iMCAwIDg1OSAxNjUiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik00MjQuMjM1IDc4LjAxMjhDNDIzLjQwOSA4Mi4zNTMyIDQyNi4yNTggODYuNTQxMyA0MzAuNTk4IDg3LjM2NzNDNDM0LjkzOCA4OC4xOTMzIDQzOS4xMjcgODUuMzQ0NCA0MzkuOTUzIDgxLjAwNEM0NDAuNzc5IDc2LjY2MzYgNDM3LjkzIDcyLjQ3NTQgNDMzLjU4OSA3MS42NDk0QzQyOS4yNDkgNzAuODIzNCA0MjUuMDYxIDczLjY3MjQgNDI0LjIzNSA3OC4wMTI4Wk00MzIuMDk0IDE0Ny41TDQzMi4wOTQgMTQ5TDQzMy41OTQgMTQ5TDQzMy41OTQgMTQ3LjVMNDMyLjA5NCAxNDcuNVpNMzQwLjUgMTQ3LjVMMzM5IDE0Ny41TDMzOSAxNDlMMzQwLjUgMTQ5TDM0MC41IDE0Ny41Wk0zNDAuNSA3MS4wMDAyTDM0MiA3MS4wMDAyTDM0MiA2OS41MDAyTDM0MC41IDY5LjUwMDJMMzQwLjUgNzEuMDAwMlpNNDMwLjU5NCA3OS41MDg0TDQzMC41OTQgMTQ3LjVMNDMzLjU5NCAxNDcuNUw0MzMuNTk0IDc5LjUwODRMNDMwLjU5NCA3OS41MDg0Wk00MzIuMDk0IDE0NkwzNDAuNSAxNDZMMzQwLjUgMTQ5TDQzMi4wOTQgMTQ5TDQzMi4wOTQgMTQ2Wk0zNDIgMTQ3LjVMMzQyIDcxLjAwMDJMMzM5IDcxLjAwMDJMMzM5IDE0Ny41TDM0MiAxNDcuNVpNMzQwLjUgNjkuNTAwMkwyLjUwMDA0IDY5LjUwMDJMMi41MDAwNCA3Mi41MDAyTDM0MC41IDcyLjUwMDJMMzQwLjUgNjkuNTAwMloiIGZpbGw9IiM1RDY4QTMiLz4KPHBhdGggZD0iTTg1MSA2OS41Qzg0Ni41ODIgNjkuNSA4NDMgNzMuMDgxNyA4NDMgNzcuNUM4NDMgODEuOTE4MyA4NDYuNTgyIDg1LjUgODUxIDg1LjVDODU1LjQxOCA4NS41IDg1OSA4MS45MTgzIDg1OSA3Ny41Qzg1OSA3My4wODE3IDg1NS40MTggNjkuNSA4NTEgNjkuNVpNNTIzIDc3LjVMNTIzIDc2TDUyMS41IDc2TDUyMS41IDc3LjVMNTIzIDc3LjVaTTUyMyAxNDcuNUw1MjMgMTQ5TDUyNC41IDE0OUw1MjQuNSAxNDcuNUw1MjMgMTQ3LjVaTTg1MSA3Nkw1MjMgNzZMNTIzIDc5TDg1MSA3OUw4NTEgNzZaTTUyMS41IDc3LjVMNTIxLjUgMTQ3LjVMNTI0LjUgMTQ3LjVMNTI0LjUgNzcuNUw1MjEuNSA3Ny41Wk01MjMgMTQ2TDQzMi41IDE0Nkw0MzIuNSAxNDlMNTIzIDE0OUw1MjMgMTQ2WiIgZmlsbD0iIzVENjhBMyIvPgo8L3N2Zz4K);
          }
        }

        .detali-item-5 {
          margin-top: 30px;
          &::before {
            top: 18px;
            right: -46px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMTg1IiBoZWlnaHQ9IjI2MiIgdmlld0JveD0iMCAwIDE4NSAyNjIiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0xODEuMzk0IDI1OS43MDVDMTg0LjkzMSAyNTcuMDU3IDE4NS42NTIgMjUyLjA0MyAxODMuMDA0IDI0OC41MDZDMTgwLjM1NyAyNDQuOTY5IDE3NS4zNDMgMjQ0LjI0OCAxNzEuODA2IDI0Ni44OTZDMTY4LjI2OSAyNDkuNTQ0IDE2Ny41NDggMjU0LjU1NyAxNzAuMTk1IDI1OC4wOTRDMTcyLjg0MyAyNjEuNjMxIDE3Ny44NTcgMjYyLjM1MyAxODEuMzk0IDI1OS43MDVaTTEyOCAyNTMuM0wxMjYuNSAyNTMuM0wxMjYuNSAyNTQuOEwxMjggMjU0LjhMMTI4IDI1My4zWk0xMjggMi4wMDAwMUwxMjkuNSAyLjAwMDAyTDEyOS41IDAuNTAwMDFMMTI4IDAuNTAwMDE1TDEyOCAyLjAwMDAxWk0xNzYuNiAyNTEuOEwxMjggMjUxLjhMMTI4IDI1NC44TDE3Ni42IDI1NC44TDE3Ni42IDI1MS44Wk0xMjkuNSAyNTMuM0wxMjkuNSAyLjAwMDAyTDEyNi41IDIuMDAwMDFMMTI2LjUgMjUzLjNMMTI5LjUgMjUzLjNaTTEyOCAwLjUwMDAxNUwwLjUwMDAxMSAwLjUwMDAxNUwwLjUwMDAwMyAzLjUwMDAxTDEyOCAzLjUwMDAxTDEyOCAwLjUwMDAxNVoiIGZpbGw9IiM1RDY4QTMiLz4KPC9zdmc+Cg==);
          }
        }
      }

      &.col-2 {
        max-width: 350px;
        min-width: 335px;
        h3 {
          padding-left: 10px;
          transform: translateX(-10px);
        }

        .detali-item-1 {
          margin-top: 95px;
          &::before {
            top: 10px;
            left: -285px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMzU1IiBoZWlnaHQ9IjMxMSIgdmlld0JveD0iMCAwIDM1NSAzMTEiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0xLjM2NDkzIDMwNS4xNzFDMi45MDU3MyAzMDkuMzEyIDcuNTExNjcgMzExLjQyIDExLjY1MjYgMzA5Ljg3OUMxNS43OTM1IDMwOC4zMzggMTcuOTAxMyAzMDMuNzMzIDE2LjM2MDUgMjk5LjU5MkMxNC44MTk3IDI5NS40NTEgMTAuMjEzNyAyOTMuMzQzIDYuMDcyODQgMjk0Ljg4NEMxLjkzMTkzIDI5Ni40MjUgLTAuMTc1ODY5IDMwMS4wMyAxLjM2NDkzIDMwNS4xNzFaTTEyOSAzMDIuMzgxTDEyOSAzMDMuODgxTDEzMC41IDMwMy44ODFMMTMwLjUgMzAyLjM4MUwxMjkgMzAyLjM4MVpNMTI5IDEuNUwxMjkgLTMuOTE5NDhlLTA2TDEyNy41IC0yLjIxOTU3ZS0wNkwxMjcuNSAxLjVMMTI5IDEuNVpNOC44NjI3MSAzMDMuODgyTDEyOSAzMDMuODgxTDEyOSAzMDAuODgxTDguODYyNyAzMDAuODgxTDguODYyNzEgMzAzLjg4MlpNMTMwLjUgMzAyLjM4MUwxMzAuNSAxLjQ5OTk5TDEyNy41IDEuNUwxMjcuNSAzMDIuMzgxTDEzMC41IDMwMi4zODFaTTEyOSAzTDM1NSAzTDM1NSA1LjEzMDI4ZS0wNkwxMjkgLTMuOTE5NDhlLTA2TDEyOSAzWiIgZmlsbD0iIzVENjhBMyIvPgo8L3N2Zz4K);
          }
        }

        .detali-item-2 {
          margin-top: 30px;
          &::before {
            top: -103px;
            left: -535px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iNjAyIiBoZWlnaHQ9IjEyMiIgdmlld0JveD0iMCAwIDYwMiAxMjIiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0wLjIyNzEwNCA3LjA0MjNDLTAuNTgyNjg5IDExLjM4NTcgMi4yODE4OSAxNS41NjMzIDYuNjI1MzMgMTYuMzczQzEwLjk2ODggMTcuMTgyOCAxNS4xNDYzIDE0LjMxODMgMTUuOTU2MSA5Ljk3NDgyQzE2Ljc2NTkgNS42MzEzOSAxMy45MDEzIDEuNDUzODcgOS41NTc4NSAwLjY0NDA3OEM1LjIxNDQxIC0wLjE2NTcxNCAxLjAzNjkgMi42OTg4NyAwLjIyNzEwNCA3LjA0MjNaTTQ4MyA4LjUwODU2TDQ4NC41IDguNTA4NTZMNDg0LjUgNy4wMDg1Nkw0ODMgNy4wMDg1Nkw0ODMgOC41MDg1NlpNNDgzIDEyMEw0ODEuNSAxMjBMNDgxLjUgMTIxLjVMNDgzIDEyMS41TDQ4MyAxMjBaTTguMDkxNTkgMTAuMDA4Nkw0ODMgMTAuMDA4Nkw0ODMgNy4wMDg1Nkw4LjA5MTU5IDcuMDA4NTZMOC4wOTE1OSAxMC4wMDg2Wk00ODEuNSA4LjUwODU2TDQ4MS41IDEyMEw0ODQuNSAxMjBMNDg0LjUgOC41MDg1Nkw0ODEuNSA4LjUwODU2Wk00ODMgMTIxLjVMNjAxLjUgMTIxLjVMNjAxLjUgMTE4LjVMNDgzIDExOC41TDQ4MyAxMjEuNVoiIGZpbGw9IiM1RDY4QTMiLz4KPC9zdmc+Cg==);
          }
        }

        .detali-item-3 {
          margin-top: 30px;
          &::before {
            top: -243px;
            left: -283px;
            z-index: 3;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjg4IiBoZWlnaHQ9IjI1OCIgdmlld0JveD0iMCAwIDI4OCAyNTgiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0xLjUwMjIzIDExLjMyMDlDMy4wNDMwMyAxNS40NjE4IDcuNjQ4OTYgMTcuNTY5NiAxMS43ODk5IDE2LjAyODhDMTUuOTMwOCAxNC40ODggMTguMDM4NiA5Ljg4MjA0IDE2LjQ5NzggNS43NDExNEMxNC45NTcgMS42MDAyMyAxMC4zNTEgLTAuNTA3NTcxIDYuMjEwMTMgMS4wMzMyM0MyLjA2OTIyIDIuNTc0MDMgLTAuMDM4NTc3MSA3LjE3OTk3IDEuNTAyMjMgMTEuMzIwOVpNMjU2LjUgOC41MzEyNEwyNTggOC41MzEyNEwyNTggNy4wMzEyNUwyNTYuNSA3LjAzMTI0TDI1Ni41IDguNTMxMjRaTTI1Ni41IDI1Ni41TDI1NSAyNTYuNUwyNTUgMjU4TDI1Ni41IDI1OEwyNTYuNSAyNTYuNVpNOSAxMC4wMzFMMjU2LjUgMTAuMDMxMkwyNTYuNSA3LjAzMTI0TDkgNy4wMzEwMUw5IDEwLjAzMVpNMjU1IDguNTMxMjRMMjU1IDI1Ni41TDI1OCAyNTYuNUwyNTggOC41MzEyNEwyNTUgOC41MzEyNFpNMjU2LjUgMjU4TDI4OCAyNThMMjg4IDI1NUwyNTYuNSAyNTVMMjU2LjUgMjU4WiIgZmlsbD0iIzVENjhBMyIvPgo8L3N2Zz4K);
          }
        }

        .detali-item-4 {
          margin-top: 30px;
          &::before {
            top: -568px;
            left: -456px;
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iNTQ2IiBoZWlnaHQ9IjU4MyIgdmlld0JveD0iMCAwIDU0NiA1ODMiIGZpbGw9Im5vbmUiIHhtbG5zPSJodHRwOi8vd3d3LnczLm9yZy8yMDAwL3N2ZyI+CjxwYXRoIGQ9Ik0xLjUwMjE1IDExLjc5QzMuMDQyOTUgMTUuOTMwOSA3LjY0ODg4IDE4LjAzODcgMTEuNzg5OCAxNi40OTc5QzE1LjkzMDcgMTQuOTU3MSAxOC4wMzg1IDEwLjM1MTIgMTYuNDk3NyA2LjIxMDI0QzE0Ljk1NjkgMi4wNjkzNCAxMC4zNTEgLTAuMDM4NDYzMyA2LjIxMDA1IDEuNTAyMzRDMi4wNjkxNCAzLjA0MzE0IC0wLjAzODY1NjQgNy42NDkwOCAxLjUwMjE1IDExLjc5Wk00MTMuNSAxMjMuNUw0MTUgMTIzLjVMNDE1IDEyMkw0MTMuNSAxMjJMNDEzLjUgMTIzLjVaTTQxMy41IDU4MS41TDQxMiA1ODEuNUw0MTIgNTgzTDQxMy41IDU4M0w0MTMuNSA1ODEuNVpNOC45OTk5MyAxMjMuNUw3LjQ5OTkzIDEyMy41TDcuNDk5OTMgMTI1TDguOTk5OTMgMTI1TDguOTk5OTMgMTIzLjVaTTQxMiAxMjMuNUw0MTIgNTgxLjVMNDE1IDU4MS41TDQxNSAxMjMuNUw0MTIgMTIzLjVaTTQxMy41IDU4M0w1NDYgNTgzTDU0NiA1ODBMNDEzLjUgNTgwTDQxMy41IDU4M1pNNy40OTk5MiA5LjAwMDExTDcuNDk5OTMgMTIzLjVMMTAuNDk5OSAxMjMuNUwxMC40OTk5IDkuMDAwMTFMNy40OTk5MiA5LjAwMDExWk04Ljk5OTkzIDEyNUw0MTMuNSAxMjVMNDEzLjUgMTIyTDguOTk5OTMgMTIyTDguOTk5OTMgMTI1WiIgZmlsbD0iIzVENjhBMyIvPgo8L3N2Zz4K);
          }
        }

        .detali-item-5 {
          margin-top: 30px;
          &::before {
            top: -18px;
            left: -177px;
            transform: rotate3d(1, 0, 0, 180deg);
            content: url(data:image/svg+xml;base64,PHN2ZyB3aWR0aD0iMjM4IiBoZWlnaHQ9IjI5IiB2aWV3Qm94PSIwIDAgMjM4IDI5IiBmaWxsPSJub25lIiB4bWxucz0iaHR0cDovL3d3dy53My5vcmcvMjAwMC9zdmciPgo8cGF0aCBkPSJNMS4zMDA3MyAyMy45ODg2QzMuMjI3NDUgMjcuOTY0NyA4LjAxMjU5IDI5LjYyNiAxMS45ODg2IDI3LjY5OTNDMTUuOTY0NyAyNS43NzI1IDE3LjYyNiAyMC45ODc0IDE1LjY5OTMgMTcuMDExNEMxMy43NzI1IDEzLjAzNTMgOC45ODc0MSAxMS4zNzQgNS4wMTEzNyAxMy4zMDA3QzEuMDM1MzIgMTUuMjI3NSAtMC42MjU5ODUgMjAuMDEyNiAxLjMwMDczIDIzLjk4ODZaTTE0MCAyMC41TDE0MCAyMkwxNDEuNSAyMkwxNDEuNSAyMC41TDE0MCAyMC41Wk0xNDAgMS40OTk5OUwxNDAgLTcuMDQ4MTNlLTA2TDEzOC41IC02LjgyNjg4ZS0wNkwxMzguNSAxLjQ5OTk5TDE0MCAxLjQ5OTk5Wk04LjUgMjJMMTQwIDIyTDE0MCAxOUw4LjUgMTlMOC41IDIyWk0xNDEuNSAyMC41TDE0MS41IDEuNDk5OTlMMTM4LjUgMS40OTk5OUwxMzguNSAyMC41TDE0MS41IDIwLjVaTTE0MCAyLjk5OTk5TDIzNy41IDIuOTk5OThMMjM3LjUgLTIuMTQyOTNlLTA1TDE0MCAtNy4wNDgxM2UtMDZMMTQwIDIuOTk5OTlaIiBmaWxsPSIjNUQ2OEEzIi8+Cjwvc3ZnPgo=);
          }
        }
      }

      h3 {
        color: #5d68a3;
        font-family: "Stolzl";
        font-size: 22px;
        font-style: normal;
        font-weight: 500;
        line-height: normal;
        margin-bottom: 10px;
        position: relative;
        background: #fff;
        position: relative;
        z-index: 5;

        display: inline-block;
      }

      p {
        color: #323232;
        font-family: "Stolzl";
        font-size: 22px;
        font-style: normal;
        font-weight: 300;
        line-height: normal;
        max-width: 333px;
        position: relative;
        z-index: 5;
        width: 100%;

        span {
          color: rgba(50, 50, 50, 0.7);
          font-weight: 400;
        }
      }

      .button-modal {
        cursor: pointer;
        color: rgba(50, 50, 50, 0.7);
        font-family: "Stolzl";
        font-size: 22px;
        font-style: normal;
        font-weight: 500;
        line-height: normal;
        text-decoration-line: underline;
        margin-top: 10px;
        transition: all 0.4s;
        position: relative;
        z-index: 5;

        &:hover {
          color: rgba(50, 50, 50, 0.9);
        }
      }
    }

    &__collapse {
      max-width: 310px;
      flex-grow: 1;

      @media (max-width: 767px) {
        max-width: 275px;
      }

      .collapse-item {
        &:not(:last-child) {
          margin-bottom: 10px;
        }

        &__title {
          border-radius: 10px;
          background: #fff;
          box-shadow: 0px 4px 14px 0px rgba(111, 111, 111, 0.15);
          display: flex;
          justify-content: space-between;
          gap: 20px;
          align-items: center;
          padding: 20px 15px;
          position: relative;
          z-index: 2;

          p {
            color: #323232;
            font-family: "Stolzl";
            font-size: 14px;
            font-style: normal;
            font-weight: 500;
            line-height: normal;
          }

          button {
            background: #fff;
            border: none;
            cursor: pointer;

            svg {
              transition: 0.4s all;
            }
          }
        }

        &__content {
          border-radius: 0px 0px 10px 10px;
          background: #f6f6f6;
          transition: all 0.4s ease;
          max-width: 80%;
          margin: 0 auto;

          @media (max-width: 992px) {
            max-width: 95%;
          }

          .text-box {
            padding: 10px 15px;
          }

          p {
            color: #323232;
            font-family: "Rubik";
            font-size: 14px;
            font-style: normal;
            font-weight: 300;
            line-height: 25px;
            letter-spacing: 0.14px;
          }
        }
      }
    }
  }
}
#detali-modal {
  border-radius: 10px;
  background: #fff;
  max-width: 1000px;
  width: 100%;

  @media (max-width: 992px) {
    padding: 30px 20px 20px !important;
    max-width: 580px;
    width: 100%;
  }

  .is-close {
    top: 5px;
    right: 5px;
    color: #323232;
    svg {
      filter: none;
    }
  }

  .detali-modal {
    display: flex;
    align-items: center;
    gap: 30px;
    @media (max-width: 992px) {
      flex-direction: column-reverse;
      gap: 20px;
    }

    &__img {
      img {
        max-width: 100%;
      }
    }

    &__content {
      @media (min-width: 993px) {
        width: 60%;
      }
      color: #323232;
      font-family: "Stolzl";
      font-style: normal;
      display: flex;
      flex-direction: column;
      gap: 30px;
    }

    &__title {
      font-size: 32px;
      font-weight: 700;
      line-height: 121.875%;

      @media (max-width: 768px) {
        font-size: 20px;
        line-height: 24px;
      }
    }

    &__decr {
      font-size: 22px;
      font-weight: 300;
      line-height: 131.818%;

      @media (max-width: 768px) {
        font-size: 16px;
      }

      span {
        font-weight: 500;
      }
    }
  }
}
</style>
